RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_usart.c
  USARTx->MDR = (USARTx->MDR & MDR_CLEAR_Mask) | USART_InitStruct->USART_Mode;
  #else
  USARTx->CR = (USARTx->CR & CR_CLEAR_Mask) | USART_InitStruct->USART_StopBits |
                USART_InitStruct->USART_WordLength | USART_InitStruct->USART_Parity |
                USART_InitStruct->USART_Mode;
  #endif

  switch (uIPAddr)
  {
    case HT_USART0_BASE:
    {
      uIPClock = CKCU_GetPeripFrequency(CKCU_PCLK_USART0);
      break;
    }
    #if !(LIBCFG_NO_USART1)
    case HT_USART1_BASE:
    {
      uIPClock = CKCU_GetPeripFrequency(CKCU_PCLK_USART1);
      break;
    }
    #endif
    case HT_UART0_BASE:
    {
      uIPClock = CKCU_GetPeripFrequency(CKCU_PCLK_UART0);
      break;
    }
    case HT_UART1_BASE:
    {
      uIPClock = CKCU_GetPeripFrequency(CKCU_PCLK_UART1);
      break;
    }
  }

  USARTx->DLR = uIPClock / (u32)USART_InitStruct->USART_BaudRate;
}

/*********************************************************************************************************//**
 * @brief Fill each USART_InitStruct member with its default value.
 * @param USART_InitStruct: pointer to a USART_InitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void USART_StructInit(USART_InitTypeDef* USART_InitStruct)
{
  /* USART_InitStruct members default value                                                                 */
  USART_InitStruct->USART_BaudRate = 9600;
  USART_InitStruct->USART_WordLength = USART_WORDLENGTH_8B;
  USART_InitStruct->USART_StopBits = USART_STOPBITS_1;
  USART_InitStruct->USART_Parity = USART_PARITY_NO;
  USART_InitStruct->USART_Mode = USART_MODE_NORMAL;
}

/*********************************************************************************************************//**
 * @brief USART/UART send data to Tx.
 * @param USARTx: Parameter to select the UxART peripheral.
 * @param Data: the data to be transmitted.
 * @retval None
 ************************************************************************************************************/
void USART_SendData(HT_USART_TypeDef* USARTx, u16 Data)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_USART_DATA(Data));

  USARTx->DR = Data;
}

/*********************************************************************************************************//**
 * @brief USART/UART receive data from Rx.
 * @param USARTx: Parameter to select the UxART peripheral.
 * @retval The received data.
 ************************************************************************************************************/
u16 USART_ReceiveData(HT_USART_TypeDef* USARTx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));

  return (u16)(USARTx->DR);
}

/*********************************************************************************************************//**
 * @brief Get the specified USART/UART status flags.
 * @param USARTx: Parameter to select the UxART peripheral.
 * @param USART_FLAG_x: Specify the flag to be check.
 *   This parameter can be one of the following values:
 *          LIBCFG_USART_V01 / LIBCFG_USART_V01_LEGACY:
 *     @arg USART_FLAG_RXDNE / USART_LSR_RFDR
 *     @arg USART_FLAG_THRE  / USART_LSR_THRE
 *     @arg USART_FLAG_TXC   / USART_LSR_TE
 *     @arg USART_FLAG_ERR   / USART_LSR_ERR
 *     @arg USART_FLAG_MODIS
 *     @arg USART_FLAG_TXDE
 *     @arg USART_FLAG_RXDR
 *     @arg USART_FLAG_RLSI
 *     @arg USART_FLAG_TOUT
 *     HT32F1xxxx:
 *     @arg USART_FLAG_RXDNE :
 *     @arg USART_FLAG_OE    :
 *     @arg USART_FLAG_PE    :
 *     @arg USART_FLAG_FE    :
 *     @arg USART_FLAG_BI    :
 *     @arg USART_FLAG_RXDR  :
 *     @arg USART_FLAG_TOUT  :
 *     @arg USART_FLAG_TXDE  :
 *     @arg USART_FLAG_TXC   :
 *     @arg USART_FLAG_RSADD :
 *     @arg USART_FLAG_CTSC  :
 *     @arg USART_FLAG_CTSS  :
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus USART_GetFlagStatus(HT_USART_TypeDef* USARTx, u32 USART_FLAG_x)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_USART_FLAG(USART_FLAG_x));

  #if (LIBCFG_USART_V01)
  if (USART_FLAG_x & USART_FLAG_FROM_IIR)
  {
    if (USARTx->IIR == (USART_FLAG_x & (~(USART_FLAG_FROM_IIR))))
    {
      return (SET);
    }
    else
    {
      return (RESET);
    }
  }
  else
  {
  #endif

  if ((USARTx->SR & USART_FLAG_x) != (u32)RESET)
  {
    return (SET);
  }
  else
  {
    return (RESET);
  }

  #if (LIBCFG_USART_V01)
  }
  #endif
}

#if (LIBCFG_USART_V01)
#else
/*********************************************************************************************************//**
 * @brief Get the specified USART/UART INT status.
 * @param USARTx: Parameter to select the UxART peripheral.
 * @param USART_INT_x: Specify if the USART/UART interrupt source.
 *   This parameter can be one of the following values:
 *     @arg USART_INT_RXDR  :
 *     @arg USART_INT_TXDE  :
 *     @arg USART_INT_TXC   :
 *     @arg USART_INT_OE    :
 *     @arg USART_INT_PE    :
 *     @arg USART_INT_FE    :
 *     @arg USART_INT_BI    :
 *     @arg USART_INT_RSADD :
 *     @arg USART_INT_TOUT  :
 *     @arg USART_INT_CTS   :
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus USART_GetIntStatus(HT_USART_TypeDef* USARTx, u32 USART_INT_x)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_USART_INT(USART_INT_x));

  if ((USARTx->IER & USART_INT_x) != (u32)RESET)
  {
    return (SET);
  }
  else
  {
    return (RESET);
  }
}

/*********************************************************************************************************//**
 * @brief Clear the specified USART/UART flags.
 * @param USARTx: where USARTx is the selected USART/UART from the USART/UART peripherals.
 * @param USART_Flag: Specify the flag to check.
 *   This parameter can be any combination of the following values:
 *     @arg USART_FLAG_OE    :
 *     @arg USART_FLAG_PE    :
 *     @arg USART_FLAG_FE    :
 *     @arg USART_FLAG_BI    :
 *     @arg USART_FLAG_TOUT  :
 *     @arg USART_FLAG_RSADD :
 *     @arg USART_FLAG_CTSC  :
 * @retval SET or RESET
 ************************************************************************************************************/
void USART_ClearFlag(HT_USART_TypeDef* USARTx, u32 USART_Flag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_USART_CLEAR_FLAG(USART_Flag));

  USARTx->SR &= USART_Flag;
}
#endif

