RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_usart.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the USART/UART interrupts.
 * @param USARTx: Parameter to select the UxART peripheral.
 * @param USART_INT_x: Specify if the USART/UART interrupt source to be enabled or disabled.
 *   This parameter can be one of the following values:
 *          LIBCFG_USART_V01 / LIBCFG_USART_V01_LEGACY
 *     @arg USART_INT_RXDR   / USART_IER_RDAIE  :
 *     @arg USART_INT_TXDE   / USART_IER_THREIE :
 *     @arg USART_INT_RLSIE  / USART_IER_RLSIE  : TXC, OE, PE, FE, BI, RSADD
 *     @arg USART_INT_MSIE   / USART_IER_MSIE   :
 *     HT32F1xxxx:
 *     @arg USART_INT_RXDR  :
 *     @arg USART_INT_TXDE  :
 *     @arg USART_INT_TXC   :
 *     @arg USART_INT_OE    :
 *     @arg USART_INT_PE    :
 *     @arg USART_INT_FE    :
 *     @arg USART_INT_BI    :
 *     @arg USART_INT_RSADD :
 *     @arg USART_INT_TOUT  :
 *     @arg USART_INT_CTS   :
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void USART_IntConfig(HT_USART_TypeDef* USARTx, u32 USART_INT_x, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_USART_INT(USART_INT_x));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  #if (LIBCFG_USART_V01)
  if (USART_INT_x & USART_INT_TOUT)
  {
    if (NewState != DISABLE)
    {
      USARTx->TPR |= USART_TIMEOUT_ON;
    }
    else
    {
      USARTx->TPR &= USART_TIMEOUT_OFF;
    }
  }
  #endif

  if (NewState != DISABLE)
  {
    USARTx->IER |= USART_INT_x;
  }
  else
  {
    USARTx->IER &= ~USART_INT_x;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the USART Tx/Rx.
 * @param USARTx: Parameter to select the USART peripheral.
 * @param TxRx: This parameter can be USART_CMD_TX or USART_CMD_RX.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void USART_TxRxCmd(HT_USART_TypeDef* USARTx, u32 TxRx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  #if (LIBCFG_USART_V01)
  if (NewState != DISABLE)
  {
    USARTx->FCR |= (USART_EN_ON << TxRx);
  }
  else
  {
    USARTx->FCR &= ~(USART_EN_ON << TxRx);
  }
  #else
  if (NewState != DISABLE)
  {
    USARTx->CR |= (USART_EN_ON << TxRx);
  }
  else
  {
    USARTx->CR &= ~(USART_EN_ON << TxRx);
  }
  #endif
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the USART/UART PDMA interface.
 * @param USARTx: Parameter to select the UxART peripheral.
 * @param USART_PDMAREQ: specify the USART/UART PDMA transfer request to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg USART_PDMAREQ_TX
 *     @arg USART_PDMAREQ_RX
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void USART_PDMACmd(HT_USART_TypeDef* USARTx, u32 USART_PDMAREQ, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_USART_PDMA_REQ(USART_PDMAREQ));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  #if (LIBCFG_USART_V01)
  if (NewState != DISABLE)
  {
    USARTx->MDR |= USART_PDMAREQ;
  }
  else
  {
    USARTx->MDR &= ~USART_PDMAREQ;
  }
  #else
  if (NewState != DISABLE)
  {
    USARTx->CR |= USART_PDMAREQ;
  }
  else
  {
    USARTx->CR &= ~USART_PDMAREQ;
  }
  #endif
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the USART/UART break control function.
 * @param USARTx: Parameter to select the USART peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void USART_ForceBreakCmd(HT_USART_TypeDef* USARTx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  #if (LIBCFG_USART_V01)
  if (NewState != DISABLE)
  {
    USARTx->LCR |= USART_BREAK_ON;
  }
  else
  {
    USARTx->LCR &= USART_BREAK_OFF;
  }
  #else
  if (NewState != DISABLE)
  {
    USARTx->CR |= USART_BREAK_ON;
  }
  else
  {
    USARTx->CR &= USART_BREAK_OFF;
  }
  #endif
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the USART/UART stick parity function.
 * @param USARTx: Parameter to select the UxART peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void USART_StickParityCmd(HT_USART_TypeDef* USARTx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  #if (LIBCFG_USART_V01)
  if (NewState != DISABLE)
  {
    USARTx->LCR |= USART_SPE_ON;
  }
  else
  {
    USARTx->LCR &= USART_SPE_OFF;
  }
  #else
  if (NewState != DISABLE)
  {
    USARTx->CR |= USART_SPE_ON | USART_PBE_ON;
  }
  else
  {
    USARTx->CR &= USART_SPE_OFF;
  }
  #endif
}

